app/views/posts/index.html.erb

  <li>Posted At:<%= post.created_at.strftime("%Y-%m-%d")%></li>
  <li>Tags:<% post.tags.each do|tag|%>
---
SELECT `tags`.* FROM `tags` INNER JOIN `posts_tags` ON `tags`.`id` = `posts_tags`.`tag_id` WHERE `posts_tags`.`post_id` = 3