app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments`
---
  def index
    @comments = Comment.all

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 4 LIMIT 1
---
  def new
    @comment = Comment.new

    if params[:parent_id]!=nil
      @ParentComment = Comment.find(params[:parent_id])

INSERT INTO `comments` (`comment`, `created_at`, `parent_id`, `post_id`, `updated_at`, `user_id`) VALUES ('tesy', '2018-04-08 16:18:23', NULL, 3, '2018-04-08 16:18:23', 2)
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.user_id=current_user.id


    respond_to do |format|
      if @comment.save

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 20 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 20
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 20 AND `comments`.`user_id` = 2 LIMIT 1
---
  def set_comment

    @comment = Comment.where(:id => params[:id],:user_id=>current_user.id).first