app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1

  def create
    #abort params[:post].inspect

    @tag=Tag.where(id:params[:post]['tags'])
    params[:post]['tags']=@tag

    @post = Post.new(params[:post])
    @post.user_id=current_user.id
    ES_Index()
#abort @post.inspect
    respond_to do |format|
      if @post.save
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` IN (0, 3, 4)
INSERT INTO `posts` (`category_id`, `comment_count`, `content`, `created_at`, `title`, `updated_at`, `user_id`) VALUES (4, 0, 'post2 content', '2018-04-09 05:32:36', 'post2', '2018-04-09 05:32:36', 2)